export class Score {
    constructor (){
        this.логика = {
          мозговой_штурм: 0,
          критическое_мышление: 0,
          рефлексивное_мышление: 0,
          стратегическое_мышление: 0
        }
        this.творчество = {
          интуиция: 0,
          креативность: 0,
          оригинальность: 0,
          продуктивность: 0,
        }
        this.эмоции = {
          понимание_эмоций: 0,
          выражение_эмоций: 0,
          восприятие_эмоций: 0,
          управление_эмоциями: 0
        }
        this.общение = {
          кругозор: 0,
          лидерство: 0,
          адекватность: 0,
          чувство_юмора: 0
        }
        this.теория = {
          понимание: 0,
          умение_доказать: 0,
          умение_объяснить: 0,
          доклады_презентации: 0
        }
        this.практика = {
          работа_в_команде: 0,
          работа_на_занятии: 0,
          работа_самостоятельно: 0,
          качество_и_время_работы: 0
        }
        this.прилежание = {
          упорство: 0,
          аккуратность: 0,
          внимательность: 0,
          самоорганизация: 0
        }
        this.квалификация = {
          специализация: 0,
          универсальность: 0
        }  
  }


}

